# Тема 2
# Урок 4 "float, int и арифметические операции"

# Задача 4.1

a = float(input("Введите длинну прямоугольника: "))
b = float(input("Введите ширину прямоугольника: "))
Square = (a * b)
Perimeter = (2 * (a + b))
print("Площадь = ", Square)
print("Периметр = ", Perimeter)

